clear; close all; clc;
%% Данные эфимирид
x = 10584969.2383; % координата Х в системе ПЗ_90 [m]
y = 2721713.86719; % координата Y в системе ПЗ_90 [m]
z = 23027096.6797; % координата Z в системе ПЗ_90 [m]
V_x = -788.876533508; % скорость по Х в системе ПЗ_90 [m/s]
V_y = 3058.68911743; % скорость по Y в системе ПЗ_90 [m/s]
V_z = 1.50871276855; % скорость по Z в системе ПЗ_90 [m/s]
a_x = 0; % ускорение по Х в системе ПЗ_90 [m/s^2]
a_y = 0; % ускорение по Y в системе ПЗ_90 [m/s^2]
a_z = -372.529029846e-9; % ускорение по Z в системе ПЗ_90 [m/s^2]

Year = 2020; % год по UTC
Month = 2; % месяц по UTC
Day = 10; % день по UTC
Hour = 13; % час по UTC
Min = 45; % минута по UTC
Sec  = 0; % секунда по UTC

t_start = 12; % время начала прогноза указывать в МДВ
t_end = 24; % время окончания прогноза указывать в МДВ
Day_start = 10; % день начала прогноза (должен совпадать с днем прихода эфемерид) указывать в МДВ

mm  = Main_balistic(x,y,z,V_x,V_y,V_z,a_x,a_y,a_z,Year,Month,Day,Hour,Min,Sec,t_start,t_end,Day_start);